Австралия/src/Catalogs/PriceLists/PriceLists.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PriceLists</name>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DisplayFormationDate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DisplayContactInformation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DisplayProductsWithoutPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyRateCalculationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContentHierarchy</name>
    <type>
      <types>EnumRef.PriceListsHierarchy</types>
    </type>
  </attributes>
  <attributes>
    <name>ResizeProportionally</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PictureHeight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PictureWidth</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ColumnsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PricePresentation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PricePeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PriceListPrintingVariant</name>
    <type>
      <types>EnumRef.PriceListPrintingVariants</types>
    </type>
  </attributes>
  <attributes>
    <name>BalancesPresentation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesEnough</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesFew</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesLot</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormationByAvailability</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesEnoughLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesEnoughLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesEnoughLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesEnoughLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesFewLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesFewLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesFewLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesFewLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesLotLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesLotLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesLotLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextPresentationBalancesLotLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ProductsPresentation</name>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ProductsAttribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AttributePresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DetailsParameter</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Width</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServiceVisibilityManagement</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceTypes</name>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProductsCategories</name>
    <attributes>
      <name>ProductsCategory</name>
      <type>
        <types>CatalogRef.ProductsCategories</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceGroups</name>
    <attributes>
      <name>PriceGroup</name>
      <type>
        <types>CatalogRef.PriceGroups</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/PriceListPrintingVariants/PriceListPrintingVariants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PriceListPrintingVariants</name>
  <enumValues>
    <name>List</name>
  </enumValues>
  <enumValues>
    <name>TwoColumns</name>
  </enumValues>
  <enumValues>
    <name>Tiles</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/PriceLists/Forms/FormAttributesCompositionTwoColumns/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	PriceList.ProductsPresentation.Load(Parameters.ProductsPresentation.Unload());
	PriceList.BalancesPresentation = Parameters.BalancesPresentation;
	PriceList.PriceListPrintingVariant = Parameters.PriceListPrintingVariant;
	
	PriceList.ColumnsCount = Parameters.ColumnsCount;
	PriceList.PictureWidth = Parameters.PictureWidth;
	PriceList.PictureHeight = Parameters.PictureHeight;
	PriceList.ResizeProportionally = Parameters.ResizeProportionally;
	
	CommonClientServer.SetFormItemProperty(Items, "PictureHeight", "Enabled", NOT PriceList.ResizeProportionally);
	
	ThisIsTiles = (PriceList.PriceListPrintingVariant = Enums.PriceListPrintingVariants.Tiles);
	
	For Each Row In PriceList.ProductsPresentation Do
		
		If Row.ProductsAttribute = "SKU" Then 
			
			CodeArticle = ?(Row.Use, "SKU", "Code");
			
		EndIf;
		
		If Row.Use Then
			
			If Row.ProductsAttribute = "Description"
				OR Row.ProductsAttribute = "DescriptionFull" Then
				
				Presentation = Row.ProductsAttribute;
				
			ElsIf Row.ProductsAttribute = "Comment" Then
				
				Presentation = "Comment";
				
			EndIf;
			
		EndIf;
		
		If Row.ProductsAttribute = "Characteristic" AND ThisIsTiles Then
			
			DisplayCharacteristics = Row.Use;
			
		EndIf;
		
	EndDo;
	
	If NOT ThisIsTiles Then
		
		CommonClientServer.SetFormItemProperty(Items, "PagePicture", "Visible", False);
		CommonClientServer.SetFormItemProperty(Items, "GroupColumnsSettings", "Visible", False);
		CommonClientServer.SetFormItemProperty(Items, "Pages", "PagesRepresentation", FormPagesRepresentation.None);
		
	EndIf;
	
	GroupCharacteristicsVisible = (GetFunctionalOption("UseCharacteristics") AND ThisIsTiles);
	
	CommonClientServer.SetFormItemProperty(Items, "GroupCharacteristics", "Visible", GroupCharacteristicsVisible);
	
	EditingAvailable = AccessRight("Edit", Metadata.Catalogs.PriceLists);
	CommonClientServer.SetFormItemProperty(Items, "Pages", "ReadOnly", NOT EditingAvailable);
	
	If CommonClientServer.IsMobileClient() Then
		
		FormItemCommandBarLabelLocation = FormItemCommandBarLabelLocation.Auto;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure CodeArticleOnChange(Item)
	
	RowSet = PriceList.ProductsPresentation.FindRows(New Structure("ProductsAttribute", "Code"));
	RowSet[0].Use = (CodeArticle = "Code");
	
	RowSet = PriceList.ProductsPresentation.FindRows(New Structure("ProductsAttribute", "SKU"));
	RowSet[0].Use = (CodeArticle = "SKU");
	
EndProcedure

&AtClient
Procedure PresentationOnChange(Item)
	
	RowSet = PriceList.ProductsPresentation.FindRows(New Structure("ProductsAttribute", "Description"));
	RowSet[0].Use = (Presentation = "Description");
	
	RowSet = PriceList.ProductsPresentation.FindRows(New Structure("ProductsAttribute", "DescriptionFull"));
	RowSet[0].Use = (Presentation = "DescriptionFull");
	
	RowSet = PriceList.ProductsPresentation.FindRows(New Structure("ProductsAttribute", "Comment"));
	RowSet[0].Use = (Presentation = "Comment");
	
EndProcedure

&AtClient
Procedure PictureWidthOnChange(Item)
	
	If PriceList.ResizeProportionally Then
		
		PriceList.PictureHeight = PriceList.PictureWidth * 5;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ResizeProportionallyOnChange(Item)
	
	CommonClientServer.SetFormItemProperty(Items, "PictureHeight", "Enabled", NOT PriceList.ResizeProportionally);
	
	If PriceList.ResizeProportionally Then
		
		PriceList.PictureHeight = PriceList.PictureWidth * 5;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure DisplayCharacteristicsOnChange(Item)
	
	RowSet = PriceList.ProductsPresentation.FindRows(New Structure("ProductsAttribute", "Characteristic"));
	RowSet[0].Use = DisplayCharacteristics;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure OK(Command)
	
	RowArray = PriceList.ProductsPresentation.FindRows(New Structure("Use", True));
	
	If RowArray.Count() = 0 Then
		
		CommonClientServer.MessageToUser(NStr("en='You must select at least one field.'; ru = 'Выберите, как минимум, одно поле.';pl = 'Musisz wybrać co najmniej jedno pole.';es_ES = 'Debe seleccionar por lo menos un campo.';es_CO = 'Debe seleccionar por lo menos un campo.';tr = 'En az bir alan seçmelisiniz.';it = 'Dovete selezionare almeno un campo.';de = 'Sie müssen mindestens ein Feld auswählen.'"));
		
	Else
		
		CloseParameter = New Structure;
		CloseParameter.Insert("CloseResult",			DialogReturnCode.OK);
		CloseParameter.Insert("ProductsPresentation",	PriceList.ProductsPresentation);
		CloseParameter.Insert("BalancesPresentation",	PriceList.BalancesPresentation);
		CloseParameter.Insert("ColumnsCount",			PriceList.ColumnsCount);
		CloseParameter.Insert("PictureWidth",			PriceList.PictureWidth);
		CloseParameter.Insert("PictureHeight",			PriceList.PictureHeight);
		CloseParameter.Insert("ResizeProportionally",	PriceList.ResizeProportionally);
		
		Close(CloseParameter);
		
	EndIf;
	
EndProcedure

#EndRegion
